app/views/supporters/index.html.erb

	if params[:user_id] != nil
		@user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]

%>
<% @user.supporters.each do |supporter| %>
---
SELECT "supporters".* FROM "supporters" WHERE "supporters"."user_id" = 6