app/views/supporters/show.html.erb


<% if @supporter.comments.empty? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."supporter_id" = 56
SELECT COUNT(*) FROM "comments" WHERE "comments"."supporter_id" = 61