app/controllers/comments_controller.rb

  def create


    @supporter = Supporter.find(params[:supporter_id])
    @comment = @supporter.comments.new(params[:comment])

    respond_to do |format|
      if @comment.save
---
SELECT "supporters".* FROM "supporters" WHERE "supporters"."id" = $1 LIMIT 1  [["id", "59"]]
INSERT INTO "comments" ("contact_type", "content", "created_at", "supporter_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"