app/controllers/supporters_controller.rb

SELECT "supporters".* FROM "supporters"
---
  def index
    @supporters = Supporter.all

SELECT "supporters".* FROM "supporters" WHERE "supporters"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @supporter = Supporter.find(params[:id])

SELECT "supporters".* FROM "supporters" WHERE "supporters"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @supporter = Supporter.find(params[:id])

INSERT INTO "supporters" ("between_streets", "cellphone", "code", "created_at", "email", "external_number", "father_last_name", "first_name", "gender", "internal_number", "mother_last_name", "municipality", "neighborhood", "nickname", "phone", "section", "street_address", "type_of_card", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"
---
  def create
    @supporter = Supporter.new(params[:supporter])

    respond_to do |format|
      if @supporter.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
---
def create
  @user = User.find(session[:user_id])

SELECT "supporters".* FROM "supporters" WHERE "supporters"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "supporters" SET "neighborhood" = '', "internal_number" = '', "municipality" = '', "gender" = 'Masculino', "between_streets" = '', "section" = '', "cellphone" = '', "code" = '', "nickname" = '', "updated_at" = '2012-01-15 08:05:36.902905', "street_address" = '', "email" = '', "phone" = '', "external_number" = '' WHERE "supporters"."id" = 53
---
  def update
    @supporter = Supporter.find(params[:id])

    respond_to do |format|
      if @supporter.update_attributes(params[:supporter])

SELECT "supporters".* FROM "supporters" WHERE "supporters"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "supporters" WHERE "supporters"."id" = $1  [["id", 2]]
---
  def destroy
    @supporter = Supporter.find(params[:id])
    @supporter.destroy