app/controllers/users_controller.rb

  def index
    if session[:user_id] != nil


        @users = User.all
---
SELECT "users".* FROM "users"

  def create

    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "municipality", "password", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 03 Jan 2012 02:01:23 UTC +00:00], ["municipality", "Tlajomulco"], ["password", "nd04spd"], ["updated_at", Tue, 03 Jan 2012 02:01:23 UTC +00:00], ["user_id", "jriverac"]]

  def update

    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes!(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "4"]]
UPDATE "users" SET "email" = 'oropezaenrique@hotmail.com', "updated_at" = '2012-01-13 06:37:37.117864' WHERE "users"."id" = 4